In [2]:
import pandas as pd

s = pd.Series([10, 20, 30], index=['a', 'b', 'c'])
print(s)

s[1]

a    10
b    20
c    30
dtype: int64

/tmp/user/11239/ipykernel_3610754/3350806130.py:6: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  s[1]

np.int64(20)

In [10]:
df = pd.DataFrame({
    'name': ['Alice', 'Bob', 'Charlie'],
    'age': [25, 30, 35],
    'city': ['Toronto', 'Vancouver', 'Montreal']
}, index=['a', 'b', 'c'])

print(df)

      name  age       city
a    Alice   25    Toronto
b      Bob   30  Vancouver
c  Charlie   35   Montreal

In [ ]:
df.iloc[1:]  
df.iloc[:, 0] 
df.iloc[[0,2],:]

      name  age      city
a    Alice   25   Toronto
c  Charlie   35  Montreal

In [13]:
df.loc["b"]
df.loc[:,"name"]
df.loc[["a", "c"], ["name", "age"]]

      name  age
a    Alice   25
c  Charlie   35

In [17]:
df[df["age"]>=30]

      name  age       city
b      Bob   30  Vancouver
c  Charlie   35   Montreal

In [24]:
df.columns
df.count()
df.sum()

name             AliceBobCharlie
age                           90
city    TorontoVancouverMontreal
dtype: object

In [27]:
df['age'] = df['age'] + 1
df['is_adult'] = df['age'] >= 18
df

      name  age       city  is_adult
a    Alice   27    Toronto      True
b      Bob   32  Vancouver      True
c  Charlie   37   Montreal      True

In [29]:
df = pd.DataFrame({
    'department': ['Sales', 'Sales', 'HR', 'HR', 'IT', 'IT'],
    'salary': [50000, 60000, 45000, 48000, 70000, 72000],
    'bonus': [5000, 6000, 4000, 4200, 8000, 8200]
})

df

  department  salary  bonus
0      Sales   50000   5000
1      Sales   60000   6000
2         HR   45000   4000
3         HR   48000   4200
4         IT   70000   8000
5         IT   72000   8200

In [30]:

df['salary'].sum()         # total salary
df['salary'].mean()        # average salary
df['salary'].max()         # highest salary
df.describe()              # summary stats for numeric columns

             salary        bonus
count      6.000000     6.000000
mean   57500.000000  5900.000000
std    11623.252557  1844.993225
min    45000.000000  4000.000000
25%    48500.000000  4400.000000
50%    55000.000000  5500.000000
75%    67500.000000  7500.000000
max    72000.000000  8200.000000

In [35]:
df.groupby('department')['salary'].mean()

df.groupby('department').agg({
    'salary': ['mean', 'max'],
    'bonus': 'sum'
})

             salary         bonus
               mean    max    sum
department
HR          46500.0  48000   8200
IT          71000.0  72000  16200
Sales       55000.0  60000  11000